Repository: svereshagin/Telebotbot
Catalog: src/middleware/locales/*/LC_MESSAGES/messages.po
Languages: it, ru

source: Hello! Proceed with the registration You can skip the process with /cancel command. Also you can return to registration with /registration or /start commands
it: Ciao! Procedi con la registrazione Puoi saltare il processo con il comando /cancel. Puoi anche tornare alla registrazione con i comandi /registration o /start.
ru: Здравствуйте! Продолжите регистрацию Вы можете пропустить процесс с помощью команды /cancel. Также вы можете вернуться к регистрации с помощью команд /registration или /start.

source: What is your name?
it: Qual è il tuo nome?
ru: Здравствуйте! Как вас зовут?

source: Choose_sex
it: Qual è il tuo sesso?
ru: Выберите_пол

source: Data received
it: Data ricevuta
ru: Данные получены

source: You are already registered.
it: Sei già registrato.
ru: Вы уже зарегистрированы.

source: You do not have an account. Proceed with registration by /add_me.
it: Non hai un account. Procedi con la registrazione usando /add_me.
ru: У вас нет аккаунта. Пожалуйста, начните регистрацию с помощью команды /add_me.

source: Your account already exists.
it: Il tuo account esiste già.
ru: Ваш аккаунт уже существует.

source: Your information has been cleared. Type /start to begin again.
it: Le tue informazioni sono state cancellate. Digita /start per ricominciare.
ru: Ваша информация была очищена. Введите /start, чтобы начать заново.

source: What is your last name?
it: Qual è il tuo cognome?
ru: Какова ваша фамилия?

source: What is your sex? (male/female)
it: Qual è il tuo sesso? (maschile/femminile)
ru: Какой у вас пол? (мужской/женский)

source: Please enter 'male' or 'female'.
it: Per favore, inserisci 'maschile' o 'femminile'.
ru: Пожалуйста, введите 'мужской' или 'женский'.

source: What is your age?
it: Qual è la tua età?
ru: Сколько вам лет?

source: What is your email?
it: Qual è la tua email?
ru: Какой у вас адрес электронной почты?

source: What is your city?
it: In quale città vivi?
ru: В каком городе вы живете?

source: Thank you for sharing! Here is a summary of your information:
it: Grazie per aver condiviso! Ecco un riepilogo delle tue informazioni:
ru: Спасибо за информацию! Вот краткое резюме ваших данных:

source: First Name: {first_name}
it: Nome: {first_name}
ru: Имя: {first_name}

source: Last Name: {last_name}
it: Cognome: {last_name}
ru: Фамилия: {last_name}

source: Sex: {sex}
it: Sesso: {sex}
ru: Пол: {sex}

source: Age: {age}
it: Età: {age}
ru: Возраст: {age}

source: Email: {email}
ru: Электронная почта: {email}

source: City: {city}
it: Città: {city}
ru: Город: {city}

source: Please enter a valid number for age.
it: Per favore, inserisci un numero valido per l'età.
ru: Пожалуйста, введите корректное число для возраста.

source: Language has been changed
it: La lingua è stata cambiata
ru: Язык изменён на русский

source: yes
it: si
ru: да

source: no
ru: нет

source: rules
ru: правила
